#### Terraform Initialization `success`
#### Terraform Plan `failure`

<details><summary>Show Plan</summary>

```

terraform
data.sops_file.secrets: Reading...
data.sops_file.secrets: Read complete after 0s [id=-]
data.pagerduty_user.me: Reading...
cloudflare_tunnel.kubernetes: Refreshing state... [id=9663fcd3-ee94-40b9-95ec-a74ec54a7610]
cloudflare_record.apps["Login"]: Refreshing state... [id=54e15f8537e8952b0bd0184f81f9f773]
cloudflare_record.ssh["pve3"]: Refreshing state... [id=f862705e50cea8654dd564898ddf4c01]
cloudflare_record.apps["Pi-hole 1"]: Refreshing state... [id=e267080c0d4cdba9853b5c25ed660b4d]
cloudflare_record.apps["Proxmox VE"]: Refreshing state... [id=fde116e796dfee8778b668c4e57a877e]
cloudflare_record.ssh["pve2"]: Refreshing state... [id=d9c4dded37e64ae2829740a37cedcc1f]
cloudflare_record.apps["Pi-hole 2"]: Refreshing state... [id=8868d7f3c639e12af4251f7cb848d0aa]
data.pagerduty_user.me: Read complete after 1s [id=PT33KZP]
cloudflare_record.ssh["pve1"]: Refreshing state... [id=1c8fd3d475ee3ab13338d816fbf945f1]
cloudflare_record.apps["Homepage"]: Refreshing state... [id=4b13b8b667a4f6d4b59f0dccea3986e4]
cloudflare_record.apps["Gatus"]: Refreshing state... [id=a93edff3b9215dd390412545b4fff184]
cloudflare_record.apps["Cloudflare Tunnel Healthcheck"]: Refreshing state... [id=bcfa7b79d1a18307082f560a291e9c7c]
pagerduty_escalation_policy.default: Refreshing state... [id=PSPKP7V]
pagerduty_service.proxmox: Refreshing state... [id=PFYIGYQ]
pagerduty_service.idrac: Refreshing state... [id=PJ86HND]
pagerduty_service_integration.proxmox: Refreshing state... [id=PXPT4AJ]
pagerduty_service_integration.idrac_pve2: Refreshing state... [id=PALE5Q9]
pagerduty_service_integration.idrac_pve1: Refreshing state... [id=PEY262Z]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # pagerduty_service.idrac has been deleted
  - resource "pagerduty_service" "idrac" {
      - id                      = "PJ86HND" -> null
        name                    = "Dell iDRAC"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # cloudflare_record.apps["Cloudflare Tunnel Healthcheck"] will be created
  + resource "cloudflare_record" "apps" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "tunnel-health.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "9663fcd3-ee94-40b9-95ec-a74ec54a7610.cfargotunnel.com"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.apps["Gatus"] will be created
  + resource "cloudflare_record" "apps" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "status.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "9663fcd3-ee94-40b9-95ec-a74ec54a7610.cfargotunnel.com"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.apps["Homepage"] will be created
  + resource "cloudflare_record" "apps" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "homepage.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "9663fcd3-ee94-40b9-95ec-a74ec54a7610.cfargotunnel.com"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.apps["Login"] will be created
  + resource "cloudflare_record" "apps" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "login.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "9663fcd3-ee94-40b9-95ec-a74ec54a7610.cfargotunnel.com"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.apps["Pi-hole 1"] will be created
  + resource "cloudflare_record" "apps" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pihole1.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "9663fcd3-ee94-40b9-95ec-a74ec54a7610.cfargotunnel.com"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.apps["Pi-hole 2"] will be created
  + resource "cloudflare_record" "apps" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pihole2.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "9663fcd3-ee94-40b9-95ec-a74ec54a7610.cfargotunnel.com"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.apps["Proxmox VE"] will be created
  + resource "cloudflare_record" "apps" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pve.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "9663fcd3-ee94-40b9-95ec-a74ec54a7610.cfargotunnel.com"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.ssh["pve1"] will be created
  + resource "cloudflare_record" "ssh" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pve1.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "9663fcd3-ee94-40b9-95ec-a74ec54a7610.cfargotunnel.com"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.ssh["pve2"] will be created
  + resource "cloudflare_record" "ssh" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pve2.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "9663fcd3-ee94-40b9-95ec-a74ec54a7610.cfargotunnel.com"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.ssh["pve3"] will be created
  + resource "cloudflare_record" "ssh" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "pve3.homecentr.one"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "9663fcd3-ee94-40b9-95ec-a74ec54a7610.cfargotunnel.com"
      + zone_id         = (sensitive value)
    }

  # pagerduty_service.idrac will be created
  + resource "pagerduty_service" "idrac" {
      + acknowledgement_timeout = "600"
      + alert_creation          = "create_alerts_and_incidents"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "14400"
      + created_at              = (known after apply)
      + description             = "Managed by Terraform"
      + escalation_policy       = "PSPKP7V"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "Dell iDRAC"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)
    }

  # pagerduty_service_integration.idrac_pve1 will be created
  + resource "pagerduty_service_integration" "idrac_pve1" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (sensitive value)
      + integration_key         = (known after apply)
      + name                    = "iDRAC PVE1 E-mail Alerts"
      + service                 = (known after apply)
      + type                    = "generic_email_inbound_integration"
      + vendor                  = (known after apply)
    }

  # pagerduty_service_integration.idrac_pve2 will be created
  + resource "pagerduty_service_integration" "idrac_pve2" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (sensitive value)
      + integration_key         = (known after apply)
      + name                    = "iDRAC PVE2 E-mail Alerts"
      + service                 = (known after apply)
      + type                    = "generic_email_inbound_integration"
      + vendor                  = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @lholota, Action: `pull_request`*